[
    {
        "Movie_name": "Cold War",
        "Characters": [
            "Joanna Kulig",
            "Tomasz Kot",
            "Borys Szyc",
            "Agata Kulesza",
            "Cédric Kahn",
            "Jeanne Balibar"
        ],
        "Director": "Paweł Pawlikowski",
        "Release_dates": [
            "(2018-05-10) (Cannes)",
            "(2018-06-08) (Poland)",
            "(2018-08-31) (United Kingdom)",
            "(2018-10-24) (France)"
        ],
        "Plot": "Plot\nIn post-World War II Poland, Wiktor (Tomasz Kot) and Irena (Agata Kulesza) are holding auditions for a state-sponsored folk music ensemble. Wiktor's attention is immediately captured by Zula (Joanna Kulig), an ambitious and captivating young woman who is faking a peasant identity and is on probation after attacking her abusive father. Wiktor and Zula quickly fall into a deep and obsessive attraction with each other and have sex after a performance. Later, Wiktor and Irena are pressured by bureaucrats to include pro-Communist and pro-Stalinist propaganda in their performances, a decision which would allow the troupe to tour the eastern bloc. Both Wiktor and Irena are opposed to the changes, but the career-driven, opportunistic Kaczmarek (Borys Szyc) agrees to the additions, and a resentful Irena quits. Kaczmarek is also interested in Zula and pressures her into spying on Wiktor for him, but Zula refuses to tell him any incriminating information. When the ensemble visits East Berlin, Wiktor plans to flee to the west with Zula, and the two affirm their love and passion. However, Zula fails to show up at a rendezvous with Wiktor, so he crosses the border alone. \n\nYears later, Zula meets Wiktor in Paris, where he is working at a jazz club. Though they both have other partners, their continued mutual attraction is clear. When Wiktor asks Zula why she failed to appear with him to cross the border, she says she lacked confidence in herself. A year later, Wiktor attends one of the troupe's performances in Yugoslavia, where Zula spots him in the audience and becomes visibly shaken. Two years later, Wiktor is working in Paris as a film score composer, where Zula reunites with him; she has married another man to obtain a visa and be with Wiktor. Wiktor attempts to build a solo career for Zula, including inflating her backstory to appear more interesting to his friend, film producer Michel, at a party, which annoys her. Meanwhile, Zula becomes jealous of Wiktor's past lovers, and as work on her record strains their relationship, she begins to drink heavily and act out in public. Wiktor and Zula finish Zula's record, but a disappointed Zula remains frustrated and unhappy. She reveals that she had an affair with Michel and insults Wiktor, causing him to strike her. She later disappears, and when Wiktor confronts Michel, he reveals she has returned to Poland.\n\n"
    },
    {
        "Movie_name": "The Salesman",
        "Characters": [
            "Shahab Hosseini",
            "Taraneh Alidoosti"
        ],
        "Director": "Asghar Farhadi",
        "Release_dates": [
            "(2016-05-21) (Cannes)",
            "(2016-08-31) (Iran)",
            "(2016-11-02) (France)"
        ],
        "Plot": "Plot\nEmad and Rana are a married couple who both work in the theatre, currently starring in a production of Death of a Salesman by Arthur Miller, with Emad portraying Willy Loman and Rana playing Linda. Emad is also a popular instructor at a local school, where the youth joke about him being a \"salesman.\" One night, their apartment begins to collapse and they flee the building with the other residents. Desperate to find a place to live, their fellow actor Babak secures another apartment for them, where a woman has recently moved out, although she left in a hurry abandoning numerous belongings. One night, Rana is home alone and begins bathing. When Emad returns, he finds she is missing and the bathroom is covered with blood. He rushes to the hospital, where he is informed by his neighbours about his wife's condition and is told to change the apartment's locks. It becomes apparent that Rana has not had an accident, but has been assaulted by an intruder. Emad also learns from neighbours that the previous tenant was a prostitute, who had conflicts with her clients.\n\nRana returns home, but suffers from trauma and is reluctant to go to the police. She does not bathe, fearing to go into the bathroom again, and in the middle of a performance, breaks down in tears and leaves the stage. Although she does not remember the face of her attacker, Emad finds the culprit left his car keys, which he matches to a pick-up parked outside. The attacker also left behind  a mobile phone and money which Rana purchased groceries with, thinking Emad had left it for her. Emad increasingly blames Babak for hiding the truth about the former tenant. After he hears a loving message from Babak on the previous tenant's answering machine, he calls Babak's character Charley a degenerate in the midst of a performance, although this is not in Miller's script.\n\n"
    },
    {
        "Movie_name": "Paterson",
        "Characters": [
            "Adam Driver",
            "Golshifteh Farahani",
            "Barry Shabaka Henley",
            "Cliff Smith",
            "Chasten Harmon",
            "William Jackson Harper",
            "Masatoshi Nagase"
        ],
        "Director": "Jim Jarmusch",
        "Release_dates": [
            "(2016-05-16) (Cannes)",
            "(2016-11-17) (Germany)",
            "(2016-12-21) (France)",
            "(2016-12-28) (United States)"
        ],
        "Plot": "Plot\nThe film spans one week, beginning with Monday, in the life of Paterson, a bus driver in Paterson, New Jersey. Every day follows much the same pattern: Paterson gets up early and goes to work, where he listens to passengers talking and, during pauses, writes poetry in a notebook he carries with him. After work he walks Marvin, his wife's dog, and stops for a beer at Shades Bar, where he interacts with the other patrons and the owner, Doc (Barry Shabaka Henley).\n\nPaterson's wife, Laura, loves his poems and has long urged him to publish them or at least make copies. He finally promises to go to the copy shop on the weekend. But when Paterson and Laura come home from a movie Saturday night, they find that Marvin has shredded his notebook, destroying his poems.\n\n"
    },
    {
        "Movie_name": "The Square",
        "Characters": [
            "Claes Bang",
            "Elisabeth Moss",
            "Dominic West",
            "Terry Notary"
        ],
        "Director": "Ruben Östlund",
        "Release_dates": [
            "(2017-05-20) (Cannes)",
            "(2017-08-25) (Sweden)",
            "(2017-10-18) (France)",
            "(2017-10-19) (Germany)",
            "(2017-11-23) (Denmark)"
        ],
        "Plot": "Plot\nChristian is the curator of the X-Royal art museum in Stockholm, formerly the Royal Palace. He is interviewed by the journalist Anne, struggling to explain museum jargon. Later, he is pulled into a confrontation in a pedestrian zone, after which Christian notices that his smartphone and wallet are missing, presumably stolen in a confidence trick. He is able to track the position of his phone on his computer, which he and his assistant Michael trace to a large apartment block. They write a threatening anonymous letter demanding the return of the phone and wallet by depositing them at a nearby 7-Eleven. Christian throws a copy of the letter in each apartment mailbox at night. Several days later, a package for Christian is actually deposited at the store, containing the phone and the completely untouched wallet.\n\nEuphoric after the success of his plan, Christian goes to a party where he meets Anne again, and ends up in her apartment. After they have sex, Anne offers to throw away his used condom but he steadfastly refuses to hand it over to her. They argue over the situation, as she believes he does not trust her to dispose of the semen rather than take it. Several days later, she meets him in the museum and states she is looking for more than casual sex. She asks him if he feels the same, but he is evasive. When Anne later tries to call him, he does not pick up the phone.\n\n"
    },
    {
        "Movie_name": "Three Billboards Outside Ebbing, Missouri",
        "Characters": [
            "Frances McDormand",
            "Woody Harrelson",
            "Sam Rockwell",
            "Abbie Cornish",
            "John Hawkes",
            "Peter Dinklage"
        ],
        "Director": "Martin McDonagh",
        "Release_dates": [
            "(2017-09-04) (Venice)",
            "(2017-11-10) (United States)",
            "(2018-01-12) (United Kingdom)"
        ],
        "Plot": "Plot\nIn the town of Ebbing, Missouri, Mildred Hayes is grieving the rape and murder of her teenage daughter, Angela, several months earlier. Angry over the lack of progress in the investigation, Mildred rents three abandoned billboards near her home and posts on them: \".mw-parser-output span.smallcaps{font-variant:small-caps}.mw-parser-output span.smallcaps-smaller{font-size:85%}Raped While Dying\", \"Still No Arrests?\", and \"How Come, Chief Willoughby?\" The billboards upset the townspeople, including Chief Bill Willoughby and the racist, violent, alcoholic Officer Jason Dixon. The open secret that Willoughby suffers from terminal pancreatic cancer adds to everyone's disapproval. Despite harassment, threats, and neglect from her son Robbie, Mildred remains determined to keep up her billboards. \n\nWhile Willoughby is sympathetic to Mildred's frustration, he finds the billboards an unfair attack on his character. Angered by her lack of respect for Willoughby's authority, Dixon threatens businessman Red Welby, who rented Mildred the billboards, and he arrests her friend and coworker, Denise, on trivial drug possession charges. Mildred is also visited by her abusive ex-husband Charlie, who blames her for Angela's death.\n\n"
    },
    {
        "Movie_name": "The Florida Project",
        "Characters": [
            "Willem Dafoe",
            "Brooklynn Prince",
            "Bria Vinaite",
            "Valeria Cotto",
            "Christopher Rivera",
            "Caleb Landry Jones"
        ],
        "Director": "Sean Baker",
        "Release_dates": [
            "(2017-05-22) (Cannes)",
            "(2017-10-06) (United States)"
        ],
        "Plot": "Plot\nSix-year-old Moonee lives with her young mother Halley in the Magic Castle, a motel in Kissimmee, Florida, near Walt Disney World. She spends most of her summer days unsupervised with her motel-resident friends Scooty and Dicky, engaging in mischief. Bobby, the manager of Magic Castle, is protective of the children. After the kids are caught spitting on a guest's car at Futureland, the motel next door, Dicky's father restricts him from playing with Moonee and Scooty for a week. \n\nWhile cleaning up the car, they get to know its owner, Stacy and her granddaughter Jancey, who are living at Futureland. Jancey and Moonee become quick friends. Later on, Dicky's family relocates to New Orleans, which saddens the group, but Dicky's father gives Dicky's toys to the kids under the guise of having no more room in his car.\n\n"
    },
    {
        "Movie_name": "Frantz",
        "Characters": [
            "Pierre Niney",
            "Paula Beer"
        ],
        "Director": "François Ozon",
        "Release_dates": [
            "(2016-07-12) (Paris premiere)",
            "(2016-09-07) (France)",
            "(2016-09-29) (Germany)"
        ],
        "Plot": "Plot\nIn Quedlinburg, Germany, in 1919, Anna, a young German woman (Paula Beer) grieving over the death of her fiancé, Frantz Hoffmeister, in World War I, leaves flowers at his grave. She sees fresh flowers and discovers that Adrien (Pierre Niney), a young Frenchman, has done the same. Adrien goes to the home of Frantz's parents, Dr. Hans and Magda Hoffmeister, and tries to speak to Hans, but when Hans hears that Adrien is French, he tells Adrien that a Frenchman killed his son and, calling the French murderers, drives Adrien away. Adrien tells Hans, \"You are right. I am a murderer\". Meanwhile, Anna is rejecting the unwelcome advances of an older suitor, particularly as she cannot forget Frantz. Anna sees Adrien at the grave and sends him a invitation him to the Hoffmeister home. After she tells the Hoffmeisters that Adrien was leaving flowers at Frantz's grave, they relent. Adrien visits and, upon questioning, recounts falsely that he and Frantz were students together in Paris before the war. He even describes their supposed last day together, when they visited the Louvre. Anna takes Adrien to the places she and Frantz used to go together, including the mountaintop where he proposed to her. Adrien, whose demeanour reminds them of Frantz, lifts Anna and the Hoffmeisters out of their despair. The Hoffmeisters ask Adrien, who had been a violinist, but whose hearing was damaged in the war, to play Frantz's violin for them, as Frantz used to do. Adrien asks Anna to go to the local ball with him and she accepts.\n\nAdrien is increasingly unable to maintain the lie. After failing to attend a dinner at the Hoffman's he was invited to, Anna finds him at night at Frantz's grave. Adrien confesses to Anna that he lied about being Frantz's friend in Paris before the war. Actually, they met as enemy soldiers on the battlefield, face to face in a trench where Adrien killed Frantz. Frantz was a pacifist and his gun was unloaded. Adrien found Frantz's last letter to Anna on his body and, wracked with guilt, resolved to visit Germany in order to seek forgiveness. Anna, heartbroken, says that she will tell the Hoffmeisters so that Adrien does not, resolving it is better for the Hoffmans to remain in ignorance of Adrein's role after they have come to like him and see him as a connection to their lost son. Adrien returns to Paris and Anna sinks back into despair, attempting to drown herself. She does not reply to Adrien's letters and destroys one he enclosed for the Hoffmans confessing his true role. After being nursed back to health by the Hoffmeisters, Anna's spirits gradually recover and she decides to contact Adrien again. When Anna sends him a letter several months later, it is returned with no forwarding address.\n\n"
    },
    {
        "Movie_name": "Joker",
        "Characters": [
            "Joaquin Phoenix"
        ],
        "Director": "Todd Phillips",
        "Release_dates": [
            "(2019-08-31) (Venice)",
            "(2019-10-04) (United States)"
        ],
        "Plot": "Plot\nIn 1981, party clown, social outsider, and aspiring stand-up comedian Arthur Fleck lives with his mother, Penny, in Gotham City. Gotham's class society is rife with crime and unemployment, leaving segments of the population disenfranchised and impoverished. Arthur suffers from a medical disorder that causes him to laugh at inappropriate times, and depends on social services for medication. After a gang of delinquents attack Arthur in an alley, his co-worker, Randall, gives him a gun for protection. Arthur meets his neighbor, single mother Sophie Dumond, and invites her to his upcoming stand-up comedy show at a nightclub.\n\nWhile entertaining at a children's hospital, Arthur's gun falls out of his pocket. Randall lies that Arthur bought the gun himself and Arthur is fired by his agent. On the subway, still in his clown makeup, Arthur is beaten by three drunken Wayne Enterprises businessmen who were harassing a female passenger; he shoots two in self-defense and executes the third to avoid getting caught by the police. The murders are condemned by billionaire mayoral candidate Thomas Wayne, who labels those envious of more successful people as \"clowns\". Demonstrations against Gotham's rich begin, with protesters donning clown masks in Arthur's image. Funding cuts shutter the social service program, leaving Arthur without his social worker to prescribe him his daily medication.\n\n"
    },
    {
        "Movie_name": "Youth",
        "Characters": [
            "Michael Caine",
            "Harvey Keitel",
            "Rachel Weisz",
            "Paul Dano",
            "Jane Fonda"
        ],
        "Director": "Paolo Sorrentino",
        "Release_dates": [
            "(2015-05-20) (Cannes)"
        ],
        "Plot": "Plot\nSeptuagenarian best friends Fred Ballinger and Mick Boyle are on vacation in the Swiss Alps, staying at a luxury spa/resort in Wiesen. Fred is a retired composer of classical music; at the hotel, he is approached by an emissary for Queen Elizabeth II, conferring a knighthood and asking him to perform his popular piece \"Simple Song #3\" at Prince Philip's birthday concert. Fred turns down the offer, claiming he is not interested in performing any more – although he still composes pieces in his head when alone. Mick is a film director, and is working with a group of writers to develop the screenplay for his latest film, which he calls his \"testament\". Also with them is actor Jimmy Tree, who is researching for an upcoming role and frustrated that he is only remembered for his role as a robot. The hotel is inhabited by other quirky individuals, including a young masseuse, an overweight Diego Maradona, and Miss Universe.\n\nFred and Mick reflect on their lives, admitting that their memories are fading and that they see little in their futures. Fred's daughter and assistant, Lena, is married to Mick's son, but the latter leaves her for pop star Paloma Faith. Lena stays at the resort and vents her anger at her father, who was always distant as she grew up. The emissary returns, and Lena cries as Fred explains that he won't perform \"Simple Song #3\" because the soprano part belongs only to his wife and she can no longer sing.\n\n"
    },
    {
        "Movie_name": "Spotlight",
        "Characters": [
            "Mark Ruffalo",
            "Michael Keaton",
            "Rachel McAdams",
            "Liev Schreiber",
            "John Slattery",
            "Stanley Tucci"
        ],
        "Director": "Tom McCarthy",
        "Release_dates": [
            "(2015-09-03) (Venice)",
            "(2015-11-06) (United States)"
        ],
        "Plot": "Plot\nIn 1976, at a Boston Police station, two policemen discuss the arrest of Catholic priest Fr. John Geoghan for child molestation and a high ranking cleric talks to the mother of the children. The Assistant District Attorney then enters the precinct and tells the policemen not to let the press get wind of what has happened. The arrest is hushed up, and the priest is released.\n\nIn 2001, The Boston Globe hires a new editor, Marty Baron. Baron meets Walter \"Robby\" Robinson, the editor of the newspaper's \"Spotlight\" team, a small group of journalists writing investigative articles that take months to research and publish. After Baron reads a Globe column about a lawyer, Mitchell Garabedian, who says that Cardinal Bernard Law (the Archbishop of Boston) knew that John Geoghan was sexually abusing children and did nothing to stop him, he urges the Spotlight team to investigate. Journalist Michael Rezendes contacts Garabedian, who initially declines to be interviewed. Though he is told not to, Rezendes reveals that he is on the Spotlight team, persuading Garabedian to talk.\n\n"
    },
    {
        "Movie_name": "Our Little Sister",
        "Characters": [
            "Haruka Ayase",
            "Masami Nagasawa",
            "Kaho",
            "Suzu Hirose"
        ],
        "Director": "Hirokazu Kore-eda",
        "Release_dates": [
            "(2015-05-14) (Cannes)",
            "(2015-06-13) (Japan)"
        ],
        "Plot": "Plot\nThere are three sisters: 29-year-old Sachi Kouda (Haruka Ayase), 22-year-old Yoshino Kouda (Masami Nagasawa) and 19-year-old Chika Kouda (Kaho). They live in the house of their grandparents in Kamakura, where they grew up after their parents had separated and left them. One day, they receive news of the death of their father whom they haven't seen in 15 years. At the funeral, they meet their 14 year old half-sister Suzu Asano (Suzu Hirose). Suzu is living with her father's wife and son, but she is not related to the wife. observing the behaviour of the wife at the funeral (she tries to pass on the responsibility of addressing the guests to Suzu) Sachi guesses that Suzu looked after their father as he died, not the wife. At the train station Sachi spontaneously invites Suzu to come and live with them. Later, Suzu moves in. She joins the local football team and becomes popular as the older sisters lives develop.\n\n"
    },
    {
        "Movie_name": "Clergy",
        "Characters": [
            "Arkadiusz Jakubik",
            "Robert Wieckiewicz",
            "Jacek Braciak"
        ],
        "Director": "Wojciech Smarzowski",
        "Release_dates": [
            "(2018-09-18) (Gdynia Polish Film Festival)",
            "(2018-09-28) (Poland)"
        ],
        "Plot": "Plot\nThree priests meet on the same date of a past event that could have taken their lives.\n\n"
    },
    {
        "Movie_name": "3 Days in Quiberon",
        "Characters": [
            "Marie Bäumer",
            "Birgit Minichmayr",
            "Charly Hübner",
            "Robert Gwisdek"
        ],
        "Director": "Emily Atef",
        "Release_dates": [
            "(2018-02-19) (Berlin)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "Mug",
        "Characters": [
            "Mateusz Kościukiewicz"
        ],
        "Director": "Małgorzata Szumowska",
        "Release_dates": [
            "(2018-02-23) (Berlin)",
            "(2018-04-06) (Poland)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "Ana, mon amour",
        "Characters": [
            "Mircea Postelnicu"
        ],
        "Director": "Călin Peter Netzer",
        "Release_dates": [
            "(2017-02-17) (Berlin)",
            "(2017-03-03) (Romania)"
        ],
        "Plot": "Plot\nAna (Diana Cavallioti) and Toma (Mircea Postelnicu) are in a heated debate over Friedrich Nietzsche's philosophy. As the argument continues they both end up in bed and have sex. Later it is revealed that Ana has anxiety attacks that border on mental illness.\n\n"
    },
    {
        "Movie_name": "1945",
        "Characters": [
            "Péter Rudolf",
            "Tamás Szabó Kimmel",
            "Dóra Sztarenki",
            "Bence Tasnádi"
        ],
        "Director": "Ferenc Török",
        "Release_dates": [
            "(2017-02-12) (Berlin)",
            "(2017-04-20) (Hungary)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "I, Daniel Blake",
        "Characters": [
            "Dave Johns",
            "Hayley Squires"
        ],
        "Director": "Ken Loach",
        "Release_dates": [
            "(2016-05-13) (Cannes)",
            "(2016-10-21) (United Kingdom)"
        ],
        "Plot": "Plot\nWidower Daniel Blake, a 59-year-old joiner from Newcastle, has had a heart attack. Though his cardiologist has not allowed him to return to work, Daniel is deemed fit to do so after a work capability assessment and denied employment and support allowance. He is frustrated to learn that his doctor was not contacted about the decision, and applies for an appeal, a process he finds difficult because he must complete forms online and is not computer literate.\n\nDaniel befriends single mother Katie after she is sanctioned for arriving late for a Jobcentre appointment. Katie and her children have just moved to Newcastle from a London homeless shelter, as there is no affordable accommodation in London. Daniel helps the family by repairing objects, teaching them how to heat rooms without electricity, and crafting wooden toys for the children.\n\n"
    },
    {
        "Movie_name": "Pain and Glory",
        "Characters": [
            "Antonio Banderas",
            "Asier Etxeandia",
            "Leonardo Sbaraglia",
            "Nora Navas",
            "Julieta Serrano",
            "Penélope Cruz"
        ],
        "Director": "\nPedro Almodóvar\n",
        "Release_dates": [
            "(2019-03-22) (Spain)"
        ],
        "Plot": "Plot\nThe film narrates a series of reunions of Salvador Mallo (Antonio Banderas), a film director in his decline. Some of these reunions play out in real time, others are recalled through flashbacks: his life in the 1960s, when he moved with his family to the primitive village of Paterna, his schooling, his first love in Madrid in the 1980s, the pain of the breakup of this relationship, writing as a therapy to forget, the discovery of cinema, facing the impossibility of continuing filming, etc.[15][16][17]\n\nSpanish film director Salvador Mallo is in the middle of a creative crisis, afflicted with physical and mental ailments, just as an earlier film of his (Sabor, or Flavor) has been remastered and re-released to appreciative audiences. Prompted by his assistant Zulema (Cecilia Roth) he calls in on Alberto Crespo (Asier Etxeandia), the lead actor from Sabor, with whom he has not spoken for 30 years due to a quarrel over the influence of the actor's heroin use on his performance. Crespo introduces Salvador to heroin smoking.  \n\n"
    },
    {
        "Movie_name": "Taxi",
        "Characters": [
            "on"
        ],
        "Director": "Jafar Panahi",
        "Release_dates": [
            "(2015-02-06) (Berlin)"
        ],
        "Plot": "Plot\nTaxi portrays director Jafar Panahi as he courses through the streets of Tehran while pretending to be a share taxi driver. He wants to hear a piece of his passengers' life and declines any payment for the services. His earliest passengers include a conservative-minded man who supports capital punishment and a woman supporting its abolition, a pirated video vendor named Omid who once lent foreign films not available in the country to Panahi, an injured man and his wife who both insist on recording a last will due to their panic, and a pair of superstitious old women wanting to release their goldfishes to a holy spring.\n\nEventually, Panahi picks up his niece Hana at her school. She discusses film-making and wants Panahi's advice on creating a short film for a school project; her teacher has talked about several rules on creating films in Iran, including the avoidance of siahnamayi, or portraying a dark image about the country. However, Hana's teacher also stated that people should create films as they see fit. The two stop near a coffeehouse where Panahi meets with a family friend he has not seen for seven years. The latter inquires about a burglary he recently experienced and his dilemma of not informing the authorities about the thieves, whom he personally knows, as they are poor and have nothing else to lose. Meanwhile, Hana films a case of siahnamayi herself when she spots a boy who steals money from a couple of newlyweds and refuses to return them.\n\n"
    },
    {
        "Movie_name": "Julieta",
        "Characters": [
            "Emma Suárez",
            "Adriana Ugarte"
        ],
        "Director": "Pedro Almodóvar",
        "Release_dates": [
            "(2016-04-08) (Spain)"
        ],
        "Plot": "Plot\nJulieta lives in Madrid and is about to move to Portugal with her boyfriend Lorenzo. In a chance encounter on the street with her daughter Antía's childhood friend Beatriz, she learns that Antía, from whom she has long been estranged, is living in Switzerland and has three children. Overcome by her desire to reestablish contact with Antía, she abandons plans to leave Spain and instead leases an apartment elsewhere in the building in Madrid where she raised Antía, knowing that address is Antía's only means of contacting her.\n\nAnticipating word from Antía, and aware that she owes her daughter an explanation of the events that led to their separation, Julieta fills a journal with an account of her life as mother, spouse, and daughter. She begins with the story of meeting Xoan, a fisherman and Antía's father. In a flashback, Julieta recounts meeting Xoan on a train, having fled to the restaurant carriage from an older man. He tells her about his life as a fisherman, and his wife who is in a coma. The train stops sharply, having hit the older man, who committed suicide. As Julieta blames herself for his death, Xoan comforts her, and they have sex on the train. Later, at the school at which she works, Julieta receives a letter from Xoan which she takes as an invitation to visit. She learns his wife has recently died and that he is with Ava, a friend. Julieta and Xoan resume their relationship, and she informs him that she is pregnant with his child. Two years later, Julieta and Antía visit Julieta's parents. Her mother is ill and apparently suffering from Alzheimer's disease, at first not recognising her daughter. Her father is having an affair with the maid, to Julieta's chagrin.\n\n"
    },
    {
        "Movie_name": "The Irishman",
        "Characters": [
            "Robert De Niro",
            "Al Pacino",
            "Joe Pesci"
        ],
        "Director": "Martin Scorsese",
        "Release_dates": [
            "(2019-09-27) (NYFF)",
            "(2019-11-01) (United States)"
        ],
        "Plot": "Plot\nIn a nursing home in his wheelchair, Frank Sheeran, an elderly World War II veteran, recounts his time as a hitman for a crime syndicate.\n\nIn 1950s Philadelphia, delivery truck driver Sheeran starts to sell some of the contents of his shipments to local gangster Felix “Skinny Razor” DiTullio. After his company accuses him of theft, union lawyer Bill Bufalino gets him off after Sheeran refuses to name his customers to the judge. Bill introduces Sheeran to his cousin Russell Bufalino, head of the Northeastern Pennsylvania crime family. Sheeran begins to do jobs for Russell and members of the local South Philadelphia underworld, including \"painting houses\". Soon, Russell introduces Sheeran to Jimmy Hoffa, head of the International Brotherhood of Teamsters, who has financial ties with the Bufalino crime family and is struggling to deal with fellow rising Teamster Anthony \"Tony Pro\" Provenzano, as well as mounting pressure from the federal government. Hoffa becomes close with Sheeran and his family, especially his daughter Peggy, and Sheeran becomes Hoffa's chief bodyguard while on the road.\n\n"
    },
    {
        "Movie_name": "Never Look Away",
        "Characters": [
            "Tom Schilling",
            "Sebastian Koch",
            "Paula Beer"
        ],
        "Director": "Florian Henckel von Donnersmarck",
        "Release_dates": [
            "(2018-09-04) (Venice)",
            "(2018-10-03) (Germany)"
        ],
        "Plot": "Plot\nAs a small child during the Nazi era, protagonist Kurt Barnert (inspired by Gerhard Richter) visits the traveling exhibition \"Entartete Kunst\" (\"Degenerate Art\") in Dresden with his beautiful and eccentric young aunt Elisabeth. Kurt is especially mesmerized by the Girl with Blue Hair, a sculpture by Eugen Hoffmann. Elisabeth later plays the piano in the nude and tells Kurt to \"never look away\"  because \"everything that is true holds beauty in it\". He will keep this advice close to his heart for the rest of his life, even when his aunt is \"euthanized\" by the Nazis because she is suspected to be schizophrenic. The doctor who orders her forced sterilization and sends her to her death is gynaecology professor Carl Seeband, the director of the Dresden women's clinic and a high-ranking member of the SS medical corps.\n\nAfter the war, Seeband is arrested by the Russians and placed in a prison camp. While there, he volunteers to assist a Russian officer's wife during a complicated birth and saves the child's life. The grateful Russian officer protects Seeband and releases him, destroying the records of his crimes against humanity.\n\n"
    },
    {
        "Movie_name": "Call Me by Your Name",
        "Characters": [
            "Armie Hammer",
            "Timothée Chalamet",
            "Michael Stuhlbarg",
            "Amira Casar",
            "Esther Garrel",
            "Victoire Du Bois"
        ],
        "Director": "Luca Guadagnino",
        "Release_dates": [
            "(2017-01-22) (Sundance)",
            "(2017-11-24) (United States)",
            "(2018-01-18) (Brazil)",
            "(2018-01-25) (Italy)"
        ],
        "Plot": "Plot\nIt is the summer of 1983. Elio, a 17-year-old Jewish-American, lives with his parents in rural northern Italy. Elio's father, a professor of archaeology, invites a 24-year-old graduate student, Oliver, who is also Jewish-American, to live with the family over the summer and help with his academic paperwork. Elio, an introspective bibliophile and a talented musician, initially thinks he has little in common with Oliver, who has a carefree and exuberant personality. Elio resents having to give up his bedroom to Oliver for the duration of his stay, and spends much of the summer reading, playing piano, and hanging out with his girlfriend, Marzia. Meanwhile, Oliver admits being attracted to one of the local girls, much to Elio's annoyance.\n\nElio and Oliver swim together, go for long walks into town, and accompany Elio's father on an archaeological trip. Elio begins a sexual relationship with Marzia and brags about it in front of Oliver to gauge his reaction, but nonetheless finds himself increasingly attracted to him. During a trip to the local post office, Elio indirectly confesses his feelings to Oliver, who tells him he should not act on them. Later that day, the two kiss, but Oliver is reluctant to go any further. They grow distant.\n\n"
    },
    {
        "Movie_name": "So Long, My Son",
        "Characters": [
            "Wang Jingchun",
            "Yong Mei",
            "Qi Xi",
            "Roy Wang",
            "Du Jiang",
            "Ai Liya",
            "Xu Cheng",
            "Li Jingjing",
            "Zhao Yanguozhang"
        ],
        "Director": "Wang Xiaoshuai",
        "Release_dates": [
            "(2019-02-14) (Berlin)[",
            "(2019-03-22) (China)["
        ],
        "Plot": "Plot\nThe film tells the story of two families over about thirty years: Liu Yaojun, Wang Liyun and their son Liu Xing ('Xingxing') together with Shen Yingming, Li Haiyan and their son Shen Hao ('Haohao'). Haohao and Xingxing were born on the same day. Both families were originally close and worked in the same factory, but became estranged in the 1980s.\n\nFollowing the death of Xingxing, who drowned while playing by a reservoir with Haohao and other children, Yaojun and Liyun moved to another province (Fujian) and adopted a 'new' boy who they rename 'Xingxing', who grows estranged from his foster parents and leaves them as a young teenager. Yingming and Haiyan make a fortune in real estate and Haohao becomes a doctor. \n\n"
    },
    {
        "Movie_name": "Close-Knit",
        "Characters": [
            "Toma Ikuta",
            "Kenta Kiritani",
            "Rie Mimura",
            "Eiko Koike",
            "Mugi Kadowaki"
        ],
        "Director": "Naoko Ogigami",
        "Release_dates": [
            "(2017-02-10) (Berlin)",
            "(2017-02-25) (Japan)"
        ],
        "Plot": "Plot\nTomo Ogawa is a neglected 11-years-old girl. She lives with her single and irresponsible mother in a small apartment, who abandons her when she falls in love with a new man. Whenever that happens, Tomo goes to live with her uncle, Makio. However, this time around, Makio is cohabitating with his girlfriend, Rinko, who is a transgender woman. The film portrays the drama that unfolds in an unconventional family and Tomo's acceptance of LGBT people.\n\n"
    },
    {
        "Movie_name": "Trumbo",
        "Characters": [
            "Bryan Cranston",
            "Adewale Akinnuoye-Agbaje",
            "Louis C.K.",
            "David James Elliott",
            "Elle Fanning",
            "John Goodman",
            "Diane Lane",
            "Michael Stuhlbarg",
            "Alan Tudyk",
            "Helen Mirren"
        ],
        "Director": "Jay Roach",
        "Release_dates": [
            "(2015-09-12) (TIFF)",
            "(2015-11-06) (United States)"
        ],
        "Plot": "Plot\nDalton Trumbo is a screenwriter whose talent places him among the elite of Hollywood. However, his active membership in the Communist Party of the USA draws the contempt of staunchly anti-Soviet entertainment-industry figures such as columnist Hedda Hopper and actor John Wayne.\n\nTrumbo is one of 10 screenwriters subpoenaed to testify before the House Committee on Un-American Activities (HUAC) regarding alleged Communist propaganda in Hollywood films. They refuse to directly answer questions, confident that a liberal majority on the Supreme Court will overturn the convictions for Contempt of Congress. Trumbo's friend Edward G. Robinson, who supports the cause, sells the Portrait of Père Tanguy to raise money for their legal defense fund. The unexpected deaths of Justices Wiley Rutledge and Frank Murphy ruin Trumbo's plan to appeal to the Supreme Court. In 1950, Trumbo serves 11 months in Federal Correctional Institution in Ashland, Kentucky.\n\n"
    },
    {
        "Movie_name": "In the Fade",
        "Characters": [
            "Diane Kruger"
        ],
        "Director": "Fatih Akin",
        "Release_dates": [
            "(2017-05-26) (Cannes)",
            "(2017-11-23) (Germany)"
        ],
        "Plot": "Plot\nSeveral years after he spent four years in prison for drug dealing, during which time he has studied business administration and gotten married, Kurdish-German Nuri Şekerci lives happily with his German wife, Katja, and their 6-year-old son, Rocco. One day, Katja drops Rocco off at Nuri's office, a small travel agency in Hamburg where he also does translation and taxes, so she can spend the afternoon with a friend. Heading out, she warns a young blonde woman leaving her new bicycle in front of the store that it will get stolen if she doesn't lock it up. When Katja returns that night, the street is blocked off. A nail bomb has gone off, injuring dozens and killing Nuri and Rocco. Katja tells the police about the woman with the bike, which had a travel compartment.\n\nThe police rule out a Jihadist motive as Nuri was neither religious nor political and initially focus on revenge by drug traffickers, though they release a composite sketch of the blonde woman. After Katja declines Nuri's parents' request to bury the bodies in Turkey, Nuri's mother coldly informs her at the funeral that her grandson would still be alive if Katja had been a better mother. Devastated, Katja uses drugs and later attempts suicide by slashing her wrists, but changes her mind and bandages them upon hearing a phone call come in (while she was bleeding) that Neo-Nazi suspects have been caught.\n\n"
    },
    {
        "Movie_name": "Portrait of a Lady on Fire",
        "Characters": [
            "Noémie Merlant",
            "Adèle Haenel"
        ],
        "Director": "Céline Sciamma",
        "Release_dates": [
            "(2019-05-19) (Cannes)",
            "(2019-09-18) (France)",
            "(2020-02-14) (United States)"
        ],
        "Plot": "Plot\nAt the end of the eighteenth century, Marianne, a young painter, is teaching painting lessons. One of her students asks her about a painting of hers, which Marianne calls \"Portrait of a Lady on Fire\".\n\nYears prior, Marianne arrives on an isolated island in Brittany. She had been commissioned to paint a portrait of a young woman named Héloïse, who is to be married off to a Milanese nobleman. Marianne is informed that Héloïse has previously refused to pose for portraits as she does not want to be married. Marianne acts as Héloïse's hired companion to be able to paint her in secret, and accompanies her on daily walks to memorize Héloïse's features.\n\n"
    },
    {
        "Movie_name": "The Danish Girl",
        "Characters": [
            "Eddie Redmayne",
            "Alicia Vikander",
            "Ben Whishaw",
            "Sebastian Koch",
            "Amber Heard",
            "Matthias Schoenaerts"
        ],
        "Director": "Tom Hooper",
        "Release_dates": [
            "(2015-09-05) (Venice)",
            "(2015-11-27) (United States)",
            "(2016-01-01) (United Kingdom)"
        ],
        "Plot": "Plot\nIn mid-1920s Copenhagen, portrait artist Gerda Wegener asks her husband, popular landscape artist Einar Wegener, to stand in for a female model who is late to come to their flat to pose for a painting she's working on.\n\nThe act of posing as a female figure unmasks Einar's life-long gender identity as a woman, who names herself Lili Elbe. This sets off a progression, first tentative and then irreversible, of leaving behind the identity as Einar, which she has struggled to maintain all her life. This takes place as both Lili and Gerda relocate to Paris; Gerda's portraits of Lili in her feminine state attract serious attention from art dealers in a way that her previous portraiture had not. It is there that Gerda tracks down art dealer Hans Axgil, a childhood friend of Lili (whom Lili had kissed when they were young). Hans and Gerda's mutual attraction is a challenge, as Gerda is navigating her changing relationship to Lili; but Hans' long-time friendship with and affection for Lili cause him to be supportive of both Lili and Gerda.\n\n"
    },
    {
        "Movie_name": "Room",
        "Characters": [
            "Brie Larson",
            "Jacob Tremblay",
            "Joan Allen",
            "Sean Bridgers",
            "William H. Macy"
        ],
        "Director": "Lenny Abrahamson",
        "Release_dates": [
            "(2015-09-04) (Telluride)",
            "(2015-10-16) (United States)",
            "(2015-10-23) (Canada)",
            "(2016-01-15) (United Kingdom and Ireland)"
        ],
        "Plot": "Plot\nIn Akron, Ohio, 24-year-old Joy Newsome and her 5-year-old son Jack live in a squalid shed they call Room. They share a bed, toilet, bathtub, television, and rudimentary kitchen; the only window is a skylight. They are captives of a man they call \"Old Nick\", Jack's biological father, who abducted Joy seven years prior and routinely rapes her while Jack sleeps in the closet. She tries to stay optimistic for her son but suffers from malnutrition and depression. She allows Jack to believe that only Room and its contents are real, and that the rest of the world exists only on television.\n\nOld Nick tells Joy that he has lost his job and threatens that he may not be able to afford their supplies in the future. That night, Jack is overcome with curiosity and ventures out of the closet while Old Nick is asleep in bed with his mother. Joy is horrified when she awakens and sees their interaction, slapping Old Nick away. As punishment, he cuts their heat and power. Joy decides to tell Jack about the outside world; he reacts with disbelief and incomprehension, but also curiosity. She has Jack fake a fever, hoping that Old Nick will take him to a hospital where he can alert the authorities, but Old Nick says he will return the following day with antibiotics.\n\n"
    },
    {
        "Movie_name": "A Wedding",
        "Characters": [
            "Lina El Arabi"
        ],
        "Director": "Stephan Streker",
        "Release_dates": [
            "(2016-08-24)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "I'm a Killer",
        "Characters": [
            "Mirosław Haniszewski",
            "Arkadiusz Jakubik",
            "Agata Kulesza",
            "Magdalena Popławska",
            "Piotr Adamczyk",
            "Karolina Staniec"
        ],
        "Director": "Maciej Pieprzyca",
        "Release_dates": [
            "(2016-09-20) (Gdynia Film Festival)",
            "(2016-11-04)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "Land of Mine",
        "Characters": [
            "Roland Møller",
            "Mikkel Følsgaard"
        ],
        "Director": "Martin Zandvliet",
        "Release_dates": [
            "(2015-09-10) (TIFF)",
            "(2015-12-03) (Denmark)"
        ],
        "Plot": "Plot\nFollowing the end of World War II in Europe and the liberation of Denmark from German occupation in May 1945, the defeated Wehrmacht evacuates the country. A Danish sergeant, Carl Leopold Rasmussen, angrily harasses a German prisoner of war carrying a Danish flag.[9] A group of young German prisoners are handed over to the Danish Army and sent to the west coast, where they are trained to remove the mines that the Germans had buried in the sand. With their bare hands, the boys are forced to perform the dangerous work by Rasmussen. They are warned not to expect any sympathy from the Danes, who resent their former occupiers. Rasmussen shares this contempt and he is determined to treat the young prisoners  without sympathy.\n\nRasmussen is rude to and contemptuous of them and the neighbouring household treats them with hostility. After marching his squad onto the dunes, he promises that they will return home in three months, if they can each defuse six mines per hour. Rasmussen begins to grow conflicted in his feelings and Sebastian Schumann, leader of the boys, attempts to remain optimistic; the boys discuss their plans for when they return home.\n\n"
    },
    {
        "Movie_name": "Afterimage",
        "Characters": [
            "Bogusław Linda"
        ],
        "Director": "Andrzej Wajda",
        "Release_dates": [
            "(2016-09-10) (TIFF)",
            "(2017-03-03) (Poland)"
        ],
        "Plot": "Plot\nThe start of the film begins in 1948 with Strzemiński as an influential lecturer at the School of Visual Arts, Lodz. However he refuses to renounce abstract art, despite the new Stalinist regime demanding only Socialist Realist art be taught. This results in him being stripped of his position at the school, his works (including his famous, “Neo-Plastic Room” at the Muzeum Sztuki in Łódź) were either withdrawn from public view or simply destroyed. Then the bureaucracy denied him his ability to make a living as a sign-painter, prevented him buying art supplies, and collecting food stamps.[6]\n\nSee also[edit]\n"
    },
    {
        "Movie_name": "Moonlight",
        "Characters": [
            "Trevante Rhodes",
            "André Holland",
            "Janelle Monáe",
            "Ashton Sanders",
            "Jharrel Jerome",
            "Naomie Harris",
            "Mahershala Ali"
        ],
        "Director": "Barry Jenkins",
        "Release_dates": [
            "(2016-09-02) (Telluride)",
            "(2016-10-21) (United States)"
        ],
        "Plot": "Plot\nIn Liberty City, Miami, Cuban drug dealer Juan finds Chiron, a withdrawn child who goes by the nickname \"Little,\" hiding from a group of bullies in a crackhouse. Juan lets Chiron spend the night with him and his girlfriend Teresa before returning Chiron to his mother Paula, who subsequently grounds him from watching TV for worrying her. Chiron continues to spend time with Juan, who teaches him how to swim and advises him to make his own path in life.\n\nOne night, Juan encounters Paula smoking crack with one of his customers. Juan berates her for her addiction and neglect of her son but she rebukes him for selling crack to her in the first place; all the while they argue over Chiron's upbringing. She implies that she knows why Chiron gets beaten up by his peers, alluding to \"the way he walks,\" before going home and taking out frustrations on Chiron. The next day, Chiron admits to Juan and Teresa that he hates his mother and asks what a \"faggot\" means. Juan describes it as \"a word used to make gay people feel bad.\" He tells Chiron it is okay to be gay and that he should not allow others to mock him. After asking Juan whether he sold drugs to Paula, Chiron leaves as Juan appears distraught and remorseful for his actions.\n\n"
    },
    {
        "Movie_name": "An Officer and a Spy",
        "Characters": [
            "Jean Dujardin",
            "Louis Garrel",
            "Emmanuelle Seigner",
            "Grégory Gadebois"
        ],
        "Director": "Roman Polanski",
        "Release_dates": [
            "(2019-08-30) (Venice)",
            "(2019-11-13) (France)",
            "(2019-11-21) (Italy)"
        ],
        "Plot": "Plot\nThe film centres on the notorious 19th century Dreyfus affair. Jean Dujardin stars as French officer Georges Picquart. After being appointed chief of the army's intelligence section (Deuxième Bureau, service de renseignement militaire) in 1895, he discovers that doctored evidence was used to convict Alfred Dreyfus, one of the few Jewish members of the French Army's general staff, of passing military secrets to the German Empire. Picquart risks his career and his life, struggling for a decade to expose the truth and liberate the wrongly convicted Dreyfus from the dreaded Devil's Island prison.\n\n"
    },
    {
        "Movie_name": "Bridge of Spies",
        "Characters": [
            "Tom Hanks",
            "Mark Rylance",
            "Amy Ryan",
            "Alan Alda"
        ],
        "Director": "Steven Spielberg",
        "Release_dates": [
            "(2015-10-04) (New York Film Festival)",
            "(2015-10-16) (United States)",
            "(2015-11-26) (Germany)"
        ],
        "Plot": "Plot\nIn 1957 New York City, Rudolf Abel is arrested and charged with spying for the Soviet Union. Insurance lawyer James B. Donovan is appointed to defend Abel, so that Abel's trial will be seen as fair. Committed to the principle that the accused deserves a vigorous defense, he mounts the best defense of Abel he can, declining along the way to cooperate in the CIA's attempts to induce him to violate the confidentiality of his communications with his client.\n\nAbel is convicted, but Donovan convinces the judge to spare Abel the death penalty because Abel had been serving his country honorably, and he might prove useful for a future prisoner exchange; Abel is sentenced to 30 years. Donovan appeals the conviction to the Supreme Court based on the lack of a search warrant for the seizure of Abel's ciphers and photography equipment. For his principled stand Donovan and his family are harassed, including shots being fired at their home. The conviction is upheld.\n\n"
    },
    {
        "Movie_name": "Amy",
        "Characters": [
            "Amy Winehouse"
        ],
        "Director": "Asif Kapadia",
        "Release_dates": [
            "(2015-05-16) (Cannes)",
            "(2015-07-03) (United Kingdom)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "Mr. Jones",
        "Characters": [
            "James Norton",
            "Vanessa Kirby",
            "Peter Sarsgaard"
        ],
        "Director": "Agnieszka Holland",
        "Release_dates": [
            "(2019-02-10) (Berlin)"
        ],
        "Plot": "Plot\nIn 1933, Gareth Jones (James Norton) is an ambitious young journalist who has gained some fame for his interview with Adolf Hitler. Thanks to his connections to the government of Lloyd George, he is able to get official permission from the United Kingdom to travel to the Soviet Union. Jones attempts to interview Stalin and find out more about the Soviet Union's economic expansion and its apparently successful five-year development plan. Jones is restricted to Moscow, but travels unofficially to Ukraine to discover the Holodomor.\n\n"
    },
    {
        "Movie_name": "The People vs. Fritz Bauer",
        "Characters": [
            "Burghart Klaußner"
        ],
        "Director": "Lars Kraume",
        "Release_dates": [
            "(2015-08-07) (Locarno)",
            "(2015-10-01) (Germany)"
        ],
        "Plot": "Plot\nBauer's driver finds his boss unconscious in the bathtub. He is taken to the hospital, while the police, politically motivated, suspected a suicide attempt. His opponents - especially Attorney General Kreidler and Paul Gebhardt of the Federal Criminal Police Office (BKA) - triumph.\n\nDuring Bauer's recovery, a file disappears from his office. He then cites the prosecutors and asks them about progress in the prosecution of Nazi criminals. However, the prosecutors can not show anything. The young prosecutor Karl Angermann reminds Bauer that he received the file in question with the request of him, Bauer, to draft a statement. Bauer gets the feeling that he can rely on the young man, and invites him to a meeting on the weekend to his home, because he imagines in his authority as \"in the enemy country\". Bauer wants to bring Adolf Eichmann from Argentina to a German court. However, since the BKA and Interpol are not responsible for political crimes, Bauer is considering engaging Israeli intelligence service Mossad.\n\n"
    },
    {
        "Movie_name": "Steve Jobs",
        "Characters": [
            "Michael Fassbender",
            "Kate Winslet",
            "Seth Rogen",
            "Jeff Daniels"
        ],
        "Director": "Danny Boyle",
        "Release_dates": [
            "(2015-09-05) (Telluride)",
            "(2015-10-09) (United States)",
            "(2015-11-13) (United Kingdom)"
        ],
        "Plot": "Plot\nIn 1984, the Apple Macintosh 128K's voice demo fails less than an hour before its unveiling at Flint Center. Apple co-founder Steve Jobs demands engineer Andy Hertzfeld fix it, threatening to publicly implicate him in the presentation's credits if he does not. Hertzfeld finally suggests faking the demo using the prototype Macintosh 512K computer.\n\nJobs rants to marketing executive Joanna Hoffman about a Time magazine article exposing his paternity dispute with ex-girlfriend Chrisann Brennan – he denies he is the father of Brennan's five-year-old daughter, Lisa. Brennan arrives with Lisa to confront him – she is bitter over his denials and his refusal to support her despite his wealth. Jobs bonds with Lisa over her MacPaint art and agrees to provide more money and a house. Apple co-founder Steve Wozniak asks Jobs to acknowledge the Apple II team in his presentation, but Jobs feels that mentioning the computer (which he considers obsolete) is unwise.\n\n"
    },
    {
        "Movie_name": "Fog in August",
        "Characters": [
            "Sebastian Koch"
        ],
        "Director": "Kai Wessel",
        "Release_dates": [
            "(2016-09-29)"
        ],
        "Plot": "Plot\nA Yenish boy named Ernst Lossa is transferred to a mental institution, where he labors under the watch of Dr. Veithausen. Ernst, initially identified as a troublemaker, lives up to his role and frequently rebels in minor ways. He does not plan to stay in the institution long, but expects to be taken home (and eventually to America) by his father, Christian Lossa, but is denied discharge based on the fact that his father has no permanent address after being released from a concentration camp.\n\nInitially, certain patients in the hospital are marked to be sent to the Hadamar Euthanasia Centre, where they are euthanized, but central authorities dictate that the euthanasia operation and decisions be transferred to individual institutions, leaving Dr. Veithausen to direct his nurses to execute patients under their care. The newly hired nurse, Sister Kiefer, has transferred from Hadamar and is willing to exterminate child patients using barbiturates. Meanwhile Sister Sophia tries to protect the children from being poisoned.  \n\n"
    },
    {
        "Movie_name": "Nocturnal Animals",
        "Characters": [
            "Amy Adams",
            "Jake Gyllenhaal",
            "Michael Shannon",
            "Aaron Taylor-Johnson",
            "Isla Fisher",
            "Armie Hammer",
            "Laura Linney",
            "Andrea Riseborough",
            "Michael Sheen"
        ],
        "Director": "Tom Ford",
        "Release_dates": [
            "(2016-09-02) (Venice)",
            "(2016-11-18) (United States)"
        ],
        "Plot": "Plot\nArt gallery owner Susan Morrow receives the manuscript for a novel penned by her estranged ex-husband Edward Sheffield along with an invitation for dinner during Edward's upcoming visit to Los Angeles. Upset by her deteriorating marriage to unfaithful businessman Hutton Morrow, Susan becomes consumed by the novel, which is both dedicated to her and named Nocturnal Animals after Edward's nickname for her.\n\nTony Hastings is a family man who runs afoul of three local troublemakers – Ray Marcus, Lou, and Turk – during a road trip through West Texas. After being forced off the road, Tony is powerless to stop Ray and Turk from kidnapping his wife, Laura, and their daughter, India, and leaving him with Lou, who forces him to drive Ray's car to the end of a road where he is abandoned. Tony manages to evade Ray and Lou when they return looking for him and makes his way to a nearby farmhouse to call the police.\n\n"
    },
    {
        "Movie_name": "Arrhythmia",
        "Characters": [
            "Aleksandr Yatsenko",
            "Irina Gorbacheva"
        ],
        "Director": "Boris Khlebnikov",
        "Release_dates": [
            "(2017-09-28)"
        ],
        "Plot": "Plot\nOleg is a young gifted paramedic. His wife Katya, a doctor, works at the hospital emergency department. She loves Oleg, but is fed up with him caring more about patients than her. She tells him she wants a divorce. The new head of Oleg's EMA substation is a cold-hearted manager who's got new strict rules to implement. Oleg couldn't care less about the rules - he's got lives to save. His attitude gets him in trouble with the new boss. The crisis at work coincides with the personal life crisis. Caught between emergency calls, alcohol-fueled off-shifts, and search for a meaning in life, Oleg and Katya have to find the binding force that keeps them together.\n\nRelease and accolades[edit]\n"
    },
    {
        "Movie_name": "The Innocents",
        "Characters": [
            "Lou de Laâge",
            "Agata Kulesza",
            "Agata Buzek",
            "Vincent Macaigne"
        ],
        "Director": "Anne Fontaine",
        "Release_dates": [
            "(2016-01-26) (Sundance)",
            "(2016-02-10) (France)"
        ],
        "Plot": "Plot\nIn Warsaw, December 1945, a nun known as Sister Maria approaches a young French female student doctor, Mathilde Beaulieu, serving with an army unit. She says there are sick women in need and is not satisfied with a referral to the Polish Red Cross.\n\nBeaulieu decides to go at night to the nun's convent, where one woman has given birth. The Mother Superior tells her that the nun was thrown out by her family and was taken in out of charity. Beaulieu  tells the Mother Superior (Abbess) that she works for the French Red Cross.\n\n"
    },
    {
        "Movie_name": "Dovlatov",
        "Characters": [
            "Milan Marić",
            "Danila Kozlovsky",
            "Helena Sujecka",
            "Artur Beschastny",
            "Anton Shagin",
            "Svetlana Khodchenkova",
            "Elena Lyadova"
        ],
        "Director": "Aleksei German Jr",
        "Release_dates": [
            "(2018-02-17) (Berlin)"
        ],
        "Plot": "Plot\nThe film tells about a few days in the life of writer Sergei Dovlatov (Milan Marić) in 1971 Leningrad, on the eve of the emigration of his friend, the future Nobel laureate Joseph Brodsky (Artur Beschastny). Sergei is determined to stay and lead a normal life with his wife Elena (Helena Sujecka) and daughter Katya (Eva Herr). Dovlatov's manuscripts are regularly rejected by the official media as his point of view is deemed undesirable. His friend is artist David (Danila Kozlovsky), a fartsovshchik who sells foreign goods on the black market. During this time Sergei tries to buy his daughter a German doll but is not able to find one anywhere.\n\n"
    },
    {
        "Movie_name": "13 Minutes",
        "Characters": [
            "Christian Friedel"
        ],
        "Director": "Oliver Hirschbiegel",
        "Release_dates": [
            "(2015-02-12) (Berlin)",
            "(2015-04-09) (Germany)"
        ],
        "Plot": "Plot\nIn November 1939, after planting a home-made bomb inside a column of a Munich bierkeller, Georg Elser (Christian Friedel) attempts to cross into neutral Switzerland but is caught at the border. His bomb detonates but misses killing German leader Adolf Hitler by just 13 minutes.\n\nThe German security services find incriminating evidence on Elser and link him to the assassination attempt. They believe Elser must have been working with a group of conspirators and proceed to torture Elser. They also round up members of his family from his home village, including Else Härlen (Katharina Schüttler), a married woman Elser has been seeing.\n\n"
    },
    {
        "Movie_name": "Piranhas",
        "Characters": [
            "No stars."
        ],
        "Director": "Claudio Giovannesi",
        "Release_dates": [
            "(2019-02-12) (Berlin)"
        ],
        "Plot": "Plot\nA group of 15-year-old boys from the neighbourhood Rione Sanità in Naples, dreaming to gain power and easy money, makes their way onto the city's world of crime. In the unconsciousness of their age, they live between good and evil deeds, thinking that crime can be their only chance of life.\n\n"
    },
    {
        "Movie_name": "Body",
        "Characters": [
            "Janusz Gajos"
        ],
        "Director": "Małgorzata Szumowska",
        "Release_dates": [
            "(2015-02-09) (Berlin)",
            "(2015-03-06) (Poland)"
        ],
        "Plot": "Plot\nOlga who struggles with anorexia is sent to psychiatric hospital by the Attorney, where she is treated by Anna - a therapist who believes herself to be able to communicate with ghosts. Anna insists that she has been in contact with Olga's dead mother and she asks the Attorney to participate in a seance.\n\n"
    },
    {
        "Movie_name": "Ingrid Bergman In Her Own Words",
        "Characters": [
            "No stars."
        ],
        "Director": "Stig Björkman",
        "Release_dates": [
            "(2015-05-19) (Cannes)",
            "(2015-08-28) (Sweden)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "The Last Family",
        "Characters": [
            "Andrzej Seweryn",
            "Dawid Ogrodnik"
        ],
        "Director": "Jan P. Matuszyński",
        "Release_dates": [
            "(2016-09-30)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "Manchester by the Sea",
        "Characters": [
            "Casey Affleck",
            "Michelle Williams",
            "Kyle Chandler",
            "Lucas Hedges"
        ],
        "Director": "Kenneth Lonergan",
        "Release_dates": [
            "(2016-01-23) (Sundance)",
            "(2016-11-18) (United States)"
        ],
        "Plot": "Plot\nLee Chandler, while working as a janitor and living a solitary life in a basement apartment in Quincy, Massachusetts, receives word that his brother Joe, a fisherman, has suffered a cardiac arrest, and dies before Lee can get to the hospital. Lee insists on being the one to tell Joe's teenage son, Patrick, about his father's death. While making funeral arrangements, they learn that Joe's body cannot be buried until spring when the ground thaws. Lee opts to remain in Manchester-by-the-Sea, Massachusetts until the delayed burial.\n\nLee meets with his brother's attorney and is shocked to discover that his brother named him Patrick's legal guardian. A flashback reveals that Lee once lived in Manchester with his then-wife Randi and their three small children. His negligence while intoxicated led to a house fire that killed the children. No criminal charges were filed against him but after being questioned at the police station, Lee grabbed a gun from an officer's holster and attempted suicide. He and his wife divorced and Lee left the town. In light of these events, Lee is reluctant to commit to the guardianship and unwilling to move back to Manchester, where the locals treat him as an outcast because of the loss of his family. \n\n"
    },
    {
        "Movie_name": "Toni Erdmann",
        "Characters": [
            "Peter Simonischek",
            "Sandra Hüller",
            "Ingrid Bisu",
            "Michael Wittenborn",
            "Thomas Loibl",
            "Trystan Pütter",
            "Hadewych Minis",
            "Lucy Russell",
            "Vlad Ivanov",
            "Victoria Cocias"
        ],
        "Director": "Maren Ade",
        "Release_dates": [
            "(2016-05-14) (Cannes)",
            "(2016-07-14) (Germany)",
            "(2016-07-15) (Austria)"
        ],
        "Plot": "Plot\nWinfried Conradi is a divorced music teacher from Aachen with a passion for bizarre pranks involving several fake personas. Following the death of his beloved dog, he decides to reconnect with his daughter, Ines, who is pursuing a career in business consulting. Ines is working in Bucharest, Romania, on an outsourcing project in the oil industry. Consumed by her work, she seems to have little time for her family.\n\nWinfried spontaneously travels to Bucharest and waits for Ines in the lobby of an office complex. After several hours, she finally appears, accompanied by several of her client's board members and on the way to a meeting. Winfried puts on sunglasses and fake teeth as a playful disguise, and approaches the group from the side while hiding behind a newspaper. Ines ignores him, but meets with him briefly after work and invites him to a business reception at the US Embassy.\n\n"
    },
    {
        "Movie_name": "Retablo",
        "Characters": [
            "Magaly Solier"
        ],
        "Director": "Alvaro Delgado-Aparicio",
        "Release_dates": [
            "(2017-08-17) (Lima)"
        ],
        "Plot": "Plot\nThe film follows Segundo (Junior Bejar Roca), a young boy in rural Peru whose father Noé (Amiel Cayo) is training him in the family tradition of designing and building religious retablos, but whose secret shatters Segundo's world and everything he believes in.[1]\n\nRelease[edit]\n"
    },
    {
        "Movie_name": "24 Weeks",
        "Characters": [
            "Julia Jentsch"
        ],
        "Director": "Anne Zohra Berrached",
        "Release_dates": [
            "(2016-02-14) (Berlin)",
            "(2016-09-22) (Germany)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "The Martian",
        "Characters": [
            "Matt Damon",
            "Jessica Chastain",
            "Kristen Wiig",
            "Jeff Daniels",
            "Michael Peña",
            "Kate Mara",
            "Sean Bean",
            "Sebastian Stan",
            "Aksel Hennie",
            "Benedict Wong",
            "Donald Glover",
            "Chiwetel Ejiofor"
        ],
        "Director": "Ridley Scott",
        "Release_dates": [
            "(2015-09-11) (TIFF)",
            "(2015-09-30) (United Kingdom)",
            "(2015-10-02) (United States)"
        ],
        "Plot": "Plot\nIn 2035, the crew of the Ares III mission to Mars is exploring Acidalia Planitia on Martian solar day (sol) 18 of their 31-sol expedition. A strong dust storm threatens to topple their Mars Ascent Vehicle (MAV), forcing them to abort the mission. During the evacuation, astronaut Mark Watney is struck by debris and lost in the storm, and telemetry from his suit's biomonitor is damaged and stops. With Watney believed dead, the storm worsening by the second, and the MAV on the verge of toppling, mission commander Melissa Lewis orders the crew to take off and return to their orbiting vessel, the Hermes.\n\nWatney awakens after the storm to a low-oxygen warning and returns to the crew's surface habitat (\"Hab\"). Performing self-surgery, he removes from his abdomen the debris that destroyed his biomonitor. He begins a video diary. Lacking communications with Earth, his only chance of rescue is via the next Mars mission, four years later: the Ares IV will be landing 3,200 kilometers (2,000 mi) away at the Schiaparelli crater. Watney's immediate concern is food; being the mission's botanist, he improvises a farm inside the Hab utilizing Martian soil fertilized with the crew's feces, water produced by extracting hydrogen from leftover rocket fuel, and potatoes intended for the Thanksgiving dinner. He also begins to modify the only functional rover for longer journeys in preparation for the long-distance travel.\n\n"
    },
    {
        "Movie_name": "The Second Mother",
        "Characters": [
            "Regina Casé",
            "Michel Joelsas",
            "Camila Márdila"
        ],
        "Director": "Anna Muylaert",
        "Release_dates": [
            "(2015-01-25) (Sundance)",
            "(2015-08-27) (Brazil)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "The Hateful Eight",
        "Characters": [
            "Samuel L. Jackson",
            "Kurt Russell",
            "Jennifer Jason Leigh",
            "Walton Goggins",
            "Demián Bichir",
            "Tim Roth",
            "Michael Madsen",
            "Bruce Dern",
            "James Parks",
            "Channing Tatum"
        ],
        "Director": "Quentin Tarantino",
        "Release_dates": [
            "(2015-12-07) (Cinerama Dome)",
            "(2015-12-25) (United States)"
        ],
        "Plot": "Plot\nIn 1877, bounty hunter Major Marquis Warren is transporting three dead bounties to the town of Red Rock, Wyoming. He hitches a ride on a stagecoach driven by O.B. Jackson. Aboard is bounty hunter John Ruth, and handcuffed to him is fugitive Daisy Domergue, whom Ruth is escorting to Red Rock to collect her bounty and watch her hang. Ruth and Warren are previous acquaintances who bonded over Warren's personal letter from Abraham Lincoln. Former Lost-Causer militiaman Chris Mannix, who is traveling to Red Rock as the town's new sheriff, persuades Ruth and Warren to let him on the stagecoach. Warren and Ruth form an alliance to protect each other's bounties.\n\nThe group seeks refuge from a blizzard at Minnie's Haberdashery, a stagecoach lodge, whose front door happens to have a broken lock. They are greeted by Bob, a Mexican, who says the owner, Minnie, is away visiting her mother. The other lodgers are Oswaldo Mobray, a hangman; Joe Gage, a quiet cowboy traveling home to visit his mother; and Sanford Smithers, a former Confederate general traveling to put his son to rest. Suspicious, Ruth disarms all but Warren. Warren inadvertently kicks a jellybean on the floor between the slats and then notices one of Minnie's jellybean jars is missing from a shelf.\n\n"
    },
    {
        "Movie_name": "Son of Saul",
        "Characters": [
            "Géza Röhrig",
            "Levente Molnár",
            "Urs Rechn"
        ],
        "Director": "László Nemes",
        "Release_dates": [
            "(2015-05-15) (Cannes)",
            "(2015-06-11) (Hungary)"
        ],
        "Plot": "Plot\nIn October 1944, Saul Ausländer (Géza Röhrig) works as a Sonderkommando Jewish–Hungarian prisoner in Auschwitz. His job is to salvage valuables from the clothing of the dead, drag bodies from the gas chambers and scrub the chambers before the next group arrives to be gassed. He works stoically, seemingly having been numbed by the daily horrors. One day following the gassing, he finds a boy who survived the gas, but is unconscious. From a distance, Saul witnesses a Nazi physician check vital signs, then methodically suffocate the boy and call for an autopsy. Saul steps forth and insists on carrying the body himself to the prison doctor, Miklós (Sándor Zsótér), a fellow Hungarian prisoner and a forced assistant to Josef Mengele. He asks Miklós to not perform the autopsy so he can give the boy a proper Jewish burial. Miklós declines his plea, but allows him time alone with the boy before the autopsy and subsequent cremation. Saul returns later and steals the boy's body and goes in search of a Rabbi to perform the ritual. He goes to Rabbi Frankel (Jerzy Walczak [pl]) in the crematorium, who dismisses Saul's concern and suggests that Saul perform the burial himself.\n\nSaul overhears Sonderkommando Abraham (Levente Molnár), talk about an uprising against the SS-guards with Oberkapo Biedermann (Urs Rechn). Biedermann first wants to photograph the camp's atrocities using a camera collected from the clothing of an earlier gassed caravan, and smuggle the pictures outside to attract attention and help. Saul asks for another rabbi and Abraham tells him of \"the Renegade,\" a Greek Rabbi who has lost his faith. Saul in return offers his assistance in their plan and is instructed to go with a prisoner (Katz) to repair a shack; he is given a piece of jewellery for use as a bribe in case he's caught. When Saul and Katz arrive at the shack, Saul pretends to fix the front door's lock, while Katz takes out a camera from inside the shack and starts to take pictures of the cremation. Saul hears the guards and hides the camera outside in a drain. The guards search the shack, only to find nothing.\n\n"
    },
    {
        "Movie_name": "The Big Short",
        "Characters": [
            "Christian Bale",
            "Steve Carell",
            "Ryan Gosling",
            "Brad Pitt"
        ],
        "Director": "Adam McKay",
        "Release_dates": [
            "(2015-11-12) (AFI Fest)",
            "(2015-12-11) (United States)"
        ],
        "Plot": "Plot\nThe film consists of three separate but concurrent stories, loosely connected by their actions in the years leading up to the 2007 housing market crash.\n\nIn 2005, eccentric hedge fund manager Michael Burry (Christian Bale) discovers that the United States housing market, based on high-risk subprime loans, is extremely unstable. Anticipating the market's collapse in the second quarter of 2007, as interest rates would rise from adjustable-rate mortgages, he proposes to create a credit default swap market, allowing him to bet against market-based mortgage-backed securities, for profit.\n\n"
    },
    {
        "Movie_name": "Mustang",
        "Characters": [
            "Elit İşcan"
        ],
        "Director": "Deniz Gamze Ergüven",
        "Release_dates": [
            "(2015-05-19) (Cannes)[",
            "(2015-06-17) (France)"
        ],
        "Plot": "Plot\nThe film starts with Lale, the youngest of the five sisters and the protagonist, bidding an emotional farewell at school to her female teacher, who is moving to Istanbul. The sisters decide to walk home instead of taking a van, to enjoy the sunny day. Along the way, they play in the water at the beach with their classmates. For one game, they sit on boys' shoulders and try to knock each other off. When they reach home, their grandmother scolds and hits them for their having this kind of bodily contact with boys and thus \"pleasuring themselves\" with them. Their uncle Erol is equally furious. From then on, the girls are forbidden from leaving the house, even for school.\n\nThe sisters feel stifled in their home as their grandmother tries to make them suitable for marriage. When in public they must now dress in drab, conservative clothing. Instead of attending school, they must stay home, where they are taught how to cook, clean and sew by their female relatives. Even so, the oldest sister, Sonay, sneaks out occasionally to meet her lover, and Lale looks for various ways to escape.\n\n"
    },
    {
        "Movie_name": "On Body and Soul",
        "Characters": [
            "Géza Morcsányi",
            "Alexandra Borbély"
        ],
        "Director": "Ildikó Enyedi",
        "Release_dates": [
            "(2017-02-10) (Berlin)",
            "(2017-03-02) (Hungary)"
        ],
        "Plot": "Plot\nEndre, a CFO at an abattoir, and Mária, the newly hired quality inspector, experience a recurring dream of being a pair of deer in the forest, though they are not aware that it is a shared dream.\n\nMária is immediately unpopular at work for her autistic behaviour and uncompromising grading of the abattoir's meat quality. Though Endre tries to befriend her, she quickly becomes uncomfortable with the interaction and rudely comments on his lame left arm. However, she repeats the conversation to herself that night, analyzing where she made her mistakes. Meanwhile, the abattoir hires a new butcher, Sanyi, who Endre takes a quick dislike to due to his cocky demeanor and unsympathetic view towards the slaughtered animals. \n\n"
    },
    {
        "Movie_name": "Cross My Heart",
        "Characters": [
            "Clare Coulter",
            "Julie Ménard"
        ],
        "Director": "Luc Picard",
        "Release_dates": [
            "(2017-09-22)"
        ],
        "Plot": "Plot\nDuring the October Crisis, when the Front de libération du Québec kidnap Canada's British ambassador James Cross and then the Quebec cabinet minister Pierre Laporte, Manon is a young girl in an impoverished Montreal family. Her father is suffering from cancer, and while her mother is suffering a nervous breakdown, she takes over the bulk of responsibility in caring for her younger brother, Mimi. The two children spend most of their time at the house of their aunt and uncle Simone and Gaston, with their cousins Martin and Denis. Observing the FLQ Manifesto read on the news, Manon is unable to understand if the FLQ are good or bad, and the conservative Gaston argues with his revolutionary son, Paul. Feeling neglected, Manon writes her own \"manifesto\" on children's rights. Manon and Mimi overhear they will be placed in a foster home. Seeking to avert this, Manon decides, based on the news, that taking a hostage is the way to get what one wants. She and Martin plot kidnapping an elderly woman, Mrs. Robinson, and write a ransom letter threatening to execute her unless demands are met, signing it the \"Family Cell\". Manon decides to omit mention of the foster home until their second \"communique\". They convince Mimi of the appeal of the plan by telling him he will finally have a \"grandmother\". Martin and Manon appear at Mrs. Robinson's house in Halloween costumes, and successfully seize and drug her. Manon, Martin, Denis and Mimi then take her to an unused cabin in Saint-Zénon, Quebec.\n\nWith the four children missing, the police are contacted. Paul soon emerges as the suspect in kidnapping the four children when the police find he has a collection of revolutionary literature, including White Niggers of America. Neither the family nor police know where Paul is. At Saint-Zénon, when Mrs. Robinson wakes up, the children realize she only speaks English, and the French-speaking children can only communicate with her in a very limited way. When Mrs. Robinson begins to have heart issues, Manon and Martin also realize she requires medication and is running low on pills. They visit a pharmacy, but the pharmacist is unwilling to fill a Montreal subscription.\n\n"
    },
    {
        "Movie_name": "Loving Vincent",
        "Characters": [
            "Robert Gulaczyk",
            "Douglas Booth",
            "Jerome Flynn",
            "Saoirse Ronan",
            "Helen McCrory",
            "Chris O'Dowd",
            "John Sessions",
            "Eleanor Tomlinson",
            "Aidan Turner"
        ],
        "Director": "Dorota KobielaHugh Welchman",
        "Release_dates": [
            "(2017-06-12) (Annecy)[",
            "(2017-09-22) (United States)[",
            "(2017-10-06) (Poland)[",
            "(2017-10-13) (United Kingdom)"
        ],
        "Plot": "Plot\nOne year after Vincent van Gogh's suicide, postman  Joseph Roulin asks his son Armand to deliver Van Gogh's last letter to his brother, Theo. Roulin finds the death suspicious, as merely weeks earlier Van Gogh claimed through letters that his mood was calm and normal. Armand reluctantly agrees and heads for Paris.\n\nPère Tanguy, a Montmartre art supplier, tells Armand that Theo actually died six months after Vincent. He suggests that Armand travel to Auvers-sur-Oise and look for Dr. Paul Gachet, who housed Van Gogh after his release from an asylum, shared his love for art, and attended the funeral. Once there, Armand learns that the doctor is out on business. So he stays at the same inn that Van Gogh did during his time in the area. There he meets the temporary proprietress Adeline Ravoux, who was fond of Van Gogh and who was also surprised by his death. At her suggestion, Armand visits the local boatman, who informs him that Van Gogh kept close company with Dr. Gachet's sheltered daughter, Marguerite. When Armand visits her, Marguerite denies and is angered when Armand implies that Van Gogh's suicidal mood could have resulted from an argument with her father.\n\n"
    },
    {
        "Movie_name": "Carol",
        "Characters": [
            "Cate Blanchett",
            "Rooney Mara",
            "Sarah Paulson",
            "Jake Lacy",
            "Kyle Chandler"
        ],
        "Director": "Todd Haynes",
        "Release_dates": [
            "(2015-05-17) (Cannes)",
            "(2015-11-20) (United States)",
            "(2015-11-27) (United Kingdom)"
        ],
        "Plot": "Plot\nDuring the Christmas season of 1952, aspiring photographer Therese Belivet is working in Frankenberg's department store in Manhattan. She meets a glamorous woman, Carol Aird, who is searching for a doll for her daughter Rindy. At Therese's recommendation, Carol purchases a model train set instead. When Carol departs she leaves her gloves on the counter. Therese mails them to her using Frankenberg's sales slip with Carol's name and address.\n\nTherese's boyfriend, Richard, wants her to go to France with him, hoping they will marry, but she is ambivalent about their relationship. A mutual friend, Dannie, invites Therese to his workplace, The New York Times, and offers to introduce her to a photo editor friend. Meanwhile, Carol is going through a difficult divorce from her husband, Harge. Carol calls Frankenberg's to thank the clerk who returned the gloves, and invites Therese to lunch. Therese visits Dannie and he kisses her, but she becomes uncomfortable and leaves.\n\n"
    },
    {
        "Movie_name": "Fences",
        "Characters": [
            "Denzel Washington",
            "Viola Davis",
            "Stephen McKinley Henderson",
            "Jovan Adepo",
            "Russell Hornsby",
            "Mykelti Williamson",
            "Saniyya Sidney"
        ],
        "Director": "Denzel Washington",
        "Release_dates": [
            "(2016-12-15) (Curran Theatre)",
            "(2016-12-16) (United States)"
        ],
        "Plot": "Plot\nIn 1950s Pittsburgh, Troy Maxson lives with his wife Rose and their son Cory, and works as a garbage collector alongside his best friend, Jim Bono. Troy's younger brother, Gabriel, sustained a head injury in World War II that left him mentally impaired, for which he received a $3,000 government payout that Troy subsequently uses as a down payment on a home for his family. Gabriel has since moved out to live across the street at \"Miss Pearl's\" house, so Troy no longer gets rent money from Gabe, which places the family under financial strain. Gabe sometimes gets in trouble with the law for his erratic behavior. Rose suggests to Troy that Gabe might be better off residing in a hospital.\n\nTroy left home at 14 after beating up his abusive father, and became a robber to sustain himself. While serving prison time for killing a man during a robbery, he met Bono and revealed himself to be a talented baseball player. He then played in the professional Negro Leagues; but he never made it to Major League Baseball, which had no black players in the years before 1947. Troy claims to have survived a near-fatal bout of pneumonia in his youth by defeating Death in a wrestling match, upon which Death vowed to return for a rematch.\n\n"
    },
    {
        "Movie_name": "Snowden",
        "Characters": [
            "Joseph Gordon-Levitt",
            "Shailene Woodley",
            "Melissa Leo",
            "Zachary Quinto",
            "Tom Wilkinson",
            "Scott Eastwood",
            "Logan Marshall-Green",
            "Timothy Olyphant",
            "Ben Schnetzer",
            "LaKeith Lee Stanfield",
            "Rhys Ifans",
            "Nicolas Cage"
        ],
        "Director": "Oliver Stone",
        "Release_dates": [
            "(2016-07-21) (San Diego Comic-Con)",
            "(2016-09-16) (United States)",
            "(2016-09-22) (Germany)"
        ],
        "Plot": "Plot\nIn 2013, Edward Snowden arranges a clandestine meeting in Hong Kong with documentarian Laura Poitras and journalist Glenn Greenwald. They discuss releasing the classified information in the former’s possession regarding illegal mass surveillance conducted by the National Security Agency (NSA). Poitras later released a documentary about this meeting titled Citizenfour, this in turn was used in a scene within the film Snowden.\n\nIn 2004, Snowden is undergoing basic training, having enlisted in the U.S. Army with intentions of matriculating to the Special Forces. He eventually fractures his tibia, and is informed that he will be receiving an administrative discharge and that he may serve his country in other ways.\n\n"
    },
    {
        "Movie_name": "Lion",
        "Characters": [
            "Dev Patel",
            "Rooney Mara",
            "David Wenham",
            "Nicole Kidman",
            "Abhishek Bharate",
            "Divian Ladwa",
            "Priyanka Bose",
            "Deepti Naval",
            "Tannishtha Chatterjee",
            "Nawazuddin Siddiqui",
            "Sunny Pawar"
        ],
        "Director": "Garth Davis",
        "Release_dates": [
            "(2016-09-10) (TIFF)",
            "(2016-11-25) (United States)",
            "(2017-01-19) (Australia)",
            "(2017-01-20) (United Kingdom)"
        ],
        "Plot": "Plot\nIn 1986, Saroo, a five-year-old boy, lives with his elder brother Guddu, his mother and his younger sister in Khandwa, India. Guddu and Saroo steal coal from freight trains to trade for milk and food. One day, Saroo follows his brother to a job and they arrive at a nearby train station, where Saroo decides to stay back and take a nap. Guddu tries to wake him up, but Saroo is too tired. When Guddu does not return, Saroo searches for him and boards a train presuming Guddu is aboard. He falls asleep again in one of the compartments, and wakes up to find the train in motion. After several days, it arrives in faraway Calcutta, where he does not understand the local Bengali language. He stands at a ticket counter and tries to obtain a ticket home, but the attendant does not recognise the name of his village, which Saroo says is \"Ganestalay\".[4] He spends the night in the station with some streetchildren, but is then woken up and forced to run when a group of men try to kidnap them.\n\nSaroo continues to wander around the city before coming across Noor, a seemingly friendly woman who takes him back to her apartment. She tells Saroo that a man named Rama will help him find his way home. Saroo runs away, sensing that Noor and Rama have sinister intentions, and escapes Noor when she chases after him. After two months of living near the Howrah Bridge, Saroo is taken to the police by a young man. Unable to trace his family, they put him in an orphanage. Three months later, Saroo is introduced to Mrs. Sood, who tells him she has placed an advertisement about him in several local newspapers, but no one has responded. She then tells him that an Australian couple is interested in adopting him. She begins to teach Saroo English and he moves to Hobart, Tasmania in 1987, under the care of Sue and John Brierley, where he slowly starts to settle in. A year later, they adopt another boy, Mantosh, who has trouble adjusting to his new home and suffers from rage and self-harm.\n\n"
    },
    {
        "Movie_name": "Summer 1993",
        "Characters": [
            "Laia Artigas"
        ],
        "Director": "Carla Simón",
        "Release_dates": [
            "(2017-02-11) (Berlin)",
            "(2017-06-30) (Spain)"
        ],
        "Plot": "Plot\nIn 1993, after her parents die of AIDS, a six-year-old orphaned girl goes to live with her uncle and his family.\n\n"
    },
    {
        "Movie_name": "American Honey",
        "Characters": [
            "Sasha Lane",
            "Shia LaBeouf",
            "Riley Keough"
        ],
        "Director": "Andrea Arnold",
        "Release_dates": [
            "(2016-05-15) (Cannes)",
            "(2016-10-14) (United Kingdom)"
        ],
        "Plot": "Plot\nStar is a teenager living in Muskogee, Oklahoma. She lives a painful life, caring for two children that aren't hers and living with their sexually abusive father, Nathan. While trying to hitchhike home one day, she spies a van full of young adults and makes eye contact with Jake, one of the boys in the group. Star follows them to a local Kmart and sees Jake dance to \"We Found Love\" on top of the registers before being forced out of the store. Star returns Jake's phone, as it had fallen out of his pocket, and he offers her a job as part of their magazine sales crew, telling her to come with him to Kansas City. Star declines but Jake nevertheless tells her to meet them in the parking lot of the local Motel 6 the next morning.\n\nPacking her belongings while Nathan is in another room, Star secretly escapes and takes the children to the club where their step-mother Misty dances. Star confronts Misty and tells her it's her turn to care for the kids, and though Misty refuses, Star runs away from the club to the motel and sleeps outside the crew's van until morning. \n\n"
    },
    {
        "Movie_name": "Roma",
        "Characters": [
            "Yalitza Aparicio",
            "Marina de Tavira"
        ],
        "Director": "Alfonso Cuarón",
        "Release_dates": [
            "(2018-08-30) (Venice)",
            "(2018-11-21) (United States)",
            "(2018-12-14) (Mexico)"
        ],
        "Plot": "Plot\nCleodegaria \"Cleo\" Gutiérrez is an indigenous live-in maid in an affluent household in the Colonia Roma neighborhood of Mexico City. The family's matriarch, Sofía, her husband, Antonio, her mother Teresa, their four young children, and another maid, Adela, also live in the house. Antonio, a doctor, leaves for a conference in Quebec. It becomes clear that Sofía and Antonio's marriage is strained. After returning briefly, Antonio leaves again, saying he is going to Quebec for a few weeks.\n\nCleo and Adela, who speak Mixtec when they are together, go out to the cinema with their boyfriends, Fermín and Ramón. However, Cleo and Fermín decide to go for a walk instead. An undisclosed amount of time later, the two of them rent a hotel room and they sleep together. Some weeks later at the cinema, Cleo tells Fermín that she thinks she is pregnant, at which point he excuses himself to use the restroom but never returns. Cleo reveals the same concern to Sofía, who takes her to get checked at the hospital where they confirm her pregnancy.\n\n"
    },
    {
        "Movie_name": "The Death of Louis XIV",
        "Characters": [
            "Jean-Pierre Léaud"
        ],
        "Director": "Albert Serra",
        "Release_dates": [
            "(2016-05-19) (Cannes)",
            "(2016-11-02) (France)"
        ],
        "Plot": NaN
    },
    {
        "Movie_name": "Once Upon a Time in Hollywood",
        "Characters": [
            "Leonardo DiCaprio",
            "Brad Pitt",
            "Margot Robbie",
            "Emile Hirsch",
            "Margaret Qualley",
            "Timothy Olyphant",
            "Austin Butler",
            "Dakota Fanning",
            "Bruce Dern",
            "Al Pacino"
        ],
        "Director": "Quentin Tarantino",
        "Release_dates": [
            "(2019-05-21) (Cannes)",
            "(2019-07-26) (United States)",
            "(2019-08-14) (United Kingdom)"
        ],
        "Plot": "Plot\nIn February 1969, veteran Hollywood actor Rick Dalton, star of 1950s Western television series Bounty Law, fears his career is coming to an end. Casting agent Marvin Schwarz advises him to travel to Italy to make Spaghetti Westerns, which Dalton feels are beneath him. Dalton's best friend and stunt double, Cliff Booth —– a war veteran skilled in hand-to-hand combat[8] who lives in a tiny trailer with his pit bull, Brandy —– drives Dalton around Los Angeles because Dalton's drinking has resulted in several DUI tickets. Booth struggles to find stunt work in Hollywood due to rumors that he murdered his wife. Actress Sharon Tate and her husband, director Roman Polanski, have moved next door to Dalton, who dreams of befriending them as a means of reviving his declining acting career. That night, Tate and Polanski attend a celebrity-filled party at the Playboy Mansion.\n\nThe next day while repairing Dalton's TV antenna, Booth reminisces about a sparring contest he had with Bruce Lee on the set of The Green Hornet which resulted in Booth being fired. Meanwhile, Charles Manson stops by the Polanski residence looking for music producer Terry Melcher, who used to live there, but is turned away by Jay Sebring. Tate goes for errands and stops at a movie theater to watch herself in the film The Wrecking Crew.\n\n"
    },
    {
        "Movie_name": "The Post",
        "Characters": [
            "Meryl Streep",
            "Tom Hanks",
            "Sarah Paulson",
            "Bob Odenkirk",
            "Tracy Letts",
            "Bradley Whitford",
            "Bruce Greenwood",
            "Matthew Rhys"
        ],
        "Director": "Steven Spielberg",
        "Release_dates": [
            "(2017-12-14) (Newseum)",
            "(2017-12-22) (United States)"
        ],
        "Plot": "Plot\nIn 1966, during the Vietnam War, State Department military analyst Daniel Ellsberg accompanies American troops in combat, documenting the U.S. military progress in the region for Secretary of Defense Robert McNamara. On the flight home, McNamara privately tells Ellsberg and William Macomber that the Vietnam war is hopeless. Upon landing, however, he tells the press he has every confidence in the war effort. Ellsberg, overhearing this, becomes disillusioned. Years later, as a civilian military contractor working for the RAND Corporation, Ellsberg surreptitiously photocopies hundreds of classified reports documenting the country's decades-long involvement in the conflict in Vietnam, dating back to the Truman administration. Ellsberg then leaks these documents to The New York Times.\n\nIn 1971, newspaper heiress Katharine Graham tries to balance a busy social life with responsibilities as owner and publisher of The Washington Post, following the deaths of her husband, Phil Graham, and her father, Eugene Meyer. She nervously prepares for the newspaper's stock-market launch, a move to help financially stabilize the paper. Graham lacks journalistic experience and is frequently overruled by her domineering male advisers and editors, including editor-in-chief Ben Bradlee and board member Arthur Parsons.\n\n"
    },
    {
        "Movie_name": "The Shape of Water",
        "Characters": [
            "Sally Hawkins",
            "Michael Shannon",
            "Richard Jenkins",
            "Doug Jones",
            "Michael Stuhlbarg",
            "Octavia Spencer"
        ],
        "Director": "Guillermo del Toro",
        "Release_dates": [
            "(2017-08-31) (Venice)",
            "(2017-12-01) (United States)"
        ],
        "Plot": "Plot\nElisa Esposito, who was found abandoned as a child by the side of a river with wounds on her neck, is mute and communicates through sign language. She works as a cleaner at a secret government laboratory in Baltimore, Maryland, in 1962, at the height of the Cold War. Her only friends are her closeted next-door neighbor Giles, a middle-aged struggling advertising illustrator, and her co-worker Zelda Fuller.\n\nThe facility receives a mysterious creature captured from a South American river by Colonel Richard Strickland, who is in charge of the project to study it. Curious about the creature, Elisa discovers it is a humanoid amphibian. She begins visiting him in secret, and the two form a close bond.\n\n"
    },
    {
        "Movie_name": "Bohemian Rhapsody",
        "Characters": [
            "Rami Malek",
            "Lucy Boynton",
            "Gwilym Lee",
            "Ben Hardy",
            "Joe Mazzello",
            "Aidan Gillen",
            "Allen Leech",
            "Tom Hollander",
            "Mike Myers"
        ],
        "Director": "Bryan Singer[a]",
        "Release_dates": [
            "(2018-10-23) (Wembley Arena)",
            "(2018-10-24) (United Kingdom)",
            "(2018-11-02) (United States)"
        ],
        "Plot": "Plot\nIn 1970 London, Farrokh \"Freddie\" Bulsara, a Parsi refugee from Zanzibar, works as a baggage handler at Heathrow Airport and lives with his parents and sister. After seeing the band Smile perform \"Doing All Right\" at a pub, Freddie encounters Mary Austin, and meets the drummer, Roger Taylor, and guitarist, Brian May. Learning their lead singer, Tim Staffell, has quit, Freddie offers to join and demonstrates his vocal ability, Roger and Brian are impressed; and let him join the band. Freddie and Mary begin dating.\n\nWith Freddie as lead singer and John Deacon on bass, the band sells out gigs across Britain. Freddie urges his bandmates to think bigger, selling their van to book Trident Studios[12] to record their debut album. An A&R rep from EMI Records, watching the band experiment, asks sound engineer Roy Thomas Baker for their demos. Freddie changes the band's name to Queen, and legally changes his own name to Freddie Mercury.\n\n"
    },
    {
        "Movie_name": "Remember",
        "Characters": [
            "Christopher Plummer",
            "Bruno Ganz",
            "Jürgen Prochnow",
            "Heinz Lieven",
            "Henry Czerny",
            "Dean Norris",
            "Martin Landau"
        ],
        "Director": "Atom Egoyan",
        "Release_dates": [
            "(2015-09-10) (Venice)",
            "(2015-10-23) (Canada)",
            "(2015-12-31) (Germany)"
        ],
        "Plot": "Plot\nIn a New York City nursing home, Auschwitz concentration camp survivor Zev Guttman, an 89-year-old dementia patient, is sitting shiva for his wife, Ruth. Another elderly patient and fellow Auschwitz survivor, the incapacitated Max Rosenbaum, reminds Zev of what he promised to do when Ruth died. Max has continually reminded Zev that their families were murdered at the camp by the Blockführer Otto Wallisch, who was believed to have immigrated to North America under the false name Rudy Kurlander. The Simon Wiesenthal Center has located four Rudy Kurlanders, but there is no evidence to arrest any of them. Max reminds Zev that they are the only two who can still recognize Wallisch.\n\nMax convinces Zev to avenge their families by seeking out and killing Wallisch and provides him written instructions to follow. Zev leaves the nursing home in a taxi and boards a train to Cleveland as a Silver Alert is issued for his disappearance. He has moments of confusion but he relies on the letter, which reminds him Ruth is dead, and Max arranges his travel. Max directs Zev to a gun shop, where he buys a Glock, and then to the four men in the U.S. and Canada named Rudy Kurlander, one of whom is the former Blockführer.\n\n"
    },
    {
        "Movie_name": "Wind River",
        "Characters": [
            "Jeremy Renner",
            "Elizabeth Olsen"
        ],
        "Director": "Taylor Sheridan",
        "Release_dates": [
            "(2017-01-21) (Sundance)",
            "(2017-08-04) (United States)",
            "(2017-08-30) (France)",
            "(2017-09-08) (United Kingdom)"
        ],
        "Plot": "Plot\nDuring the winter on the Wind River Indian Reservation in Wyoming, expert tracker and U.S. Fish and Wildlife Service agent Cory Lambert discovers the frozen body of 18-year-old Natalie Hanson in the snow. Her body is barefoot, without proper winter attire, miles from any building, and has a blood-stained groin. FBI Special Agent Jane Banner arrives to investigate a possible homicide, because the FBI has jurisdiction over murder cases on reservations. The next day, Banner learns from Natalie's father, Martin, that his daughter was dating a new boyfriend, but he does not know the man's name or where he lives. The autopsy shows blunt trauma and sexual violence and confirms Lambert's deduction that the girl died from exposure. She suffered pulmonary hemorrhage caused by rapid inhalation of sub-zero air. However, the medical examiner is unable to confirm the death as a homicide, and Agent Banner cannot get additional help from FBI investigators. \n\nLambert discovers that Natalie's \"new boyfriend\" was Matt Rayburn, who works security at a nearby oil drilling site. The next day, Matt's body is discovered, nude and already ravaged by scavenging wildlife. Lambert tells Agent Banner about his own daughter's death three years earlier. Her body was discovered in the snow, following a party at their house while he and his wife were away. No one was charged in her death.\n\n"
    },
    {
        "Movie_name": "Arrival",
        "Characters": [
            "Amy Adams",
            "Jeremy Renner",
            "Forest Whitaker",
            "Michael Stuhlbarg",
            "Tzi Ma"
        ],
        "Director": "Denis Villeneuve",
        "Release_dates": [
            "(2016-09-01) (Venice)",
            "(2016-11-11) (United States)"
        ],
        "Plot": "Plot\nLinguist Louise Banks's daughter, Hannah, dies in adolescence from an incurable illness.\n\nTwelve extraterrestrial spacecraft silently hover over disparate locations around the Earth. Affected nations send military and scientific experts to monitor and study them; in the United States, U.S. Army Colonel G.T. Weber recruits Banks and physicist Ian Donnelly to study the craft above Montana. On board, Banks and Donnelly make contact with two seven-limbed aliens, whom they call \"heptapods\"; Donnelly nicknames them Abbott and Costello. They both begin researching the aliens’ written language of complicated circular symbols, sharing results with other nations. As Banks studies the language, she starts to have flashback-like visions of her daughter.\n\n"
    },
    {
        "Movie_name": "If Beale Street Could Talk",
        "Characters": [
            "KiKi Layne",
            "Stephan James",
            "Colman Domingo",
            "Teyonah Parris",
            "Michael Beach",
            "Dave Franco",
            "Diego Luna",
            "Pedro Pascal",
            "Ed Skrein",
            "Brian Tyree Henry",
            "Regina King"
        ],
        "Director": "Barry Jenkins",
        "Release_dates": [
            "(2018-09-09) (TIFF)",
            "(2018-12-14) (United States)"
        ],
        "Plot": "Plot\nWhile the film is presented in a non-linear structure, this plot summary is written in a linear fashion.\n\nClementine \"Tish\" Rivers and Alonzo \"Fonny\" Hunt have been friends their whole lives, and begin a romantic relationship when they are older. It is the early 1970s, and they struggle to find a place to live as most New York City landlords refuse to rent apartments to black people. They eventually find a place in a warehouse in the process of being converted to loft apartments; Levy, the Jewish landlord, agrees to rent it to them at a reasonable rate because he enjoys seeing couples who are in love, regardless of their race.\n\n"
    },
    {
        "Movie_name": "Sweet Bean",
        "Characters": [
            "Kirin Kiki"
        ],
        "Director": "Naomi Kawase",
        "Release_dates": [
            "(2015-05-14) (Cannes)",
            "(2015-05-30) (Japan)"
        ],
        "Plot": "Plot\nThe film centres around Sentaro, a middle-aged man who runs a small dorayaki shop in the outskirts of Tokyo. The shop is frequented by locals as well as secondary-school pupils. When he puts up a notice saying that he is looking for a co-worker, he is approached by Tokue, a lady in her mid-seventies, who states that she has always wanted to work in a dorayaki shop. Sentaro initially rejects her application, afraid that the work would prove too much for the old lady who, moreover, has somewhat deformed hands. He is swayed, however, when he tries Tokue's bean paste; its taste and texture are far superior to that of the factory-made bean paste Sentaro has been using. Sentaro asks Tokue to start making bean paste with him, revealing that up until now, he did not actually like his own product.\n\nBusiness begins to thrive, and very soon Tokue also starts serving customers and packaging dorayaki. However, when customers realise that the deformities to Tokue's hand were caused by leprosy, they stop coming, and Sentaro is forced to let her go. Wakana, a school girl whom Sentaro has befriended, eventually suggests that they go and visit Tokue at the sanatorium where she and other patients were forced to stay until the 1996 repeal of the 1953 Leprosy Prevention Law. Sentaro feels guilty that he was not able to protect Tokue against the prejudice of their customers, but she assures him that she is grateful for the time she was allowed to spend at the shop.\n\n"
    },
    {
        "Movie_name": "Summertime",
        "Characters": [
            "Cécile de France",
            "Izïa Higelin",
            "Noémie Lvovsky"
        ],
        "Director": "Catherine Corsini",
        "Release_dates": [
            "(2015-08-06) (Locarno)",
            "(2015-08-19)"
        ],
        "Plot": "Plot\nSet in 1971, Delphine is the only child of French farmers and enjoys working the land. Though her father wants her to marry, Delphine is secretly pursuing a relationship with a local girl. When she goes for a rendezvous with her, her girlfriend tells her that she plans to marry, dismissing the relationship between her and Delphine as \"not serious\": Delphine responds by running away to Paris.\n\nWalking down a street, Delphine encounters a group of women running by and pinching men's buttocks. When one of the men attacks one of the woman, Delphine helps protect her and learns that her name is Carole. The women belong to a feminist group. which they encourage Delphine to join and participate in their protests. When one of the group members learns that her best friend, a gay man, has been committed to a mental institution by his family and is being given electroshock therapy, the rest of the group refuses at first to help rescue him. Delphine convinces them otherwise, and she, Carole and some of the other women free him. The following night, Delphine kisses Carole, who is surprised and rejects her. The next day Carole tells Delphine that she is not a lesbian, but the two wind up in a passionate embrace. Carole initially believes that it is a one night stand, but quickly develops feelings for Delphine. She tells her boyfriend and the two struggle to work out their relationship even as Carole continues to see Delphine.\n\n"
    }
]